In [3]:
# import libraries
import pandas as pd
import numpy as np
import os

In [4]:
file_path = r"D:\career Foundary\Data_immersion\4_python_projects\Instacart Basket Analysis"

In [5]:
# Import products.csv
df_products = pd.read_csv(os.path.join(file_path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [6]:
# Import orders.csv
df_orders = pd.read_csv(os.path.join(file_path,'02 Data', 'Original Data', 'orders.csv'), index_col = False)

In [7]:
#import df_ords_prior
df_orders_prior = pd.read_csv(os.path.join(file_path,'02 Data', 'Original Data', 'order_products__prior.csv'), index_col = False)

In [8]:
#import df_ords_prior
df_ords = pd.read_csv(os.path.join(file_path,'02 Data', 'prepared Data', 'orders_clean.csv'), index_col = False)

In [9]:
# Define a dictionary containing January 2020 data

In [10]:
data1 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'purchased_meat':[0, 13, 3, 4],
    'purchased_alcohol':[1, 2, 10, 0],
    'purchased_snacks':[10, 5, 1, 7]}

In [11]:
# Define a dictionary containing February 2020 data

In [12]:
data2 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
    'purchased_meat':[0, 10, 5, 3],
    'purchased_alcohol':[2, 4, 14, 0],
    'purchased_snacks':[15, 3, 2, 6]}

In [13]:
# Next, create dataframes out of the two dictionaries you just created and check the output. This can be done via the following code:

In [14]:
#Convert the dictionary into dataframe. By using the pd.DataFrame function, you’re converting your Python dictionaries into dataframes

In [15]:
df_data1 = pd.DataFrame(data1,index=[0, 1, 2, 3])
df_data2 = pd.DataFrame(data2,index=[0, 1, 2, 3])

In [16]:
df_data1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [17]:
df_data2

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [18]:
Table = [df_data1, df_data2]

In [19]:
df_concat = pd.concat(Table)

In [20]:
df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [21]:
# If, however, you wanted to place the two dataframes side by side (creating a wide-format dataframe), you’d need to use a different argument: axis = 1.

In [22]:
df_concat = pd.concat (Table, axis = 1)

In [23]:
df_concat

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

 # Appending Data

In [24]:
# Appending data is a straightforward approach for adding rows to an existing dataframe with the same number of columns
# All you have to be sure of is that your two dataframes have the same number of columns

In [25]:
df_appended = df_data1.append(df_data2)

In [26]:
df_appended

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [27]:
df_merged = df.merge(df_data2, on = 'customer_id')

NameError: name 'df' is not defined

In [ ]:
df_merged.head()

In [ ]:
# column tells pandas that the “customer_id” column is the common column between the two.
# The result is a wide-format dataframe with all the information from both dataframes and, most importantly, no rows with missing values.

In [ ]:
 # df_merged = df.merge(df_data2, on = ['customer_id', 'month']). when you have more than one parameter to merge your data.

In [ ]:
df_merged = df.merge(df_data2, on = ['customer_id', 'month'], indicator = True)

In [ ]:
# This argument creates a new column that reports on the specifics of the merge. When included in your merge, pandas will create an additional column in the final dataframe that indicates the source of the data within that row. A value of both means the key (or keys) you specified exist in both dataframes, while a value of left_only or right_only indicates that the key only exists in either the left or right dataframe

In [ ]:
# To check, we use

In [ ]:
df_merged["_merge"].value_counts()

the function df.merge(df_2, on = ['customer_id', 'month'], how = 'inner'), for example, would merge the df_data2 dataframe with the df_data dataframe using an inner join.

 # Merging Your Instacart Data

In [ ]:
# How, then, are you supposed to combine different column

In [9]:
df_orders_prior.shape

(32434489, 4)

In [10]:
df_orders_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [12]:
df_ords.shape

(3421083, 7)

In [13]:
df_merged_large = df_ords.merge(df_orders_prior, on = 'order_id', indicator = True)

In [14]:
df_merged_large.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [15]:
df_merged_large["_merge"].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

# Export Merged Dataframe

In [ ]:
# Export data to csv

In [16]:
df_merged_large.to_csv(os.path.join(file_path, '02 Data','Prepared Data', 'orders_products_combined.csv'))

In [ ]:
# Export data to pkl

In [18]:
df_merged_large.to_pickle(os.path.join(file_path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))

# Ex 4.6

In [19]:
df_orders_products_combined =  pd.read_csv(os.path.join(file_path, '02 Data','Prepared Data', 'orders_products_combined.csv'), index_col = False)

In [20]:
# Step 4: Check df_orders_products_combined size
df_orders_products_combined.shape

(32434489, 12)

In [ ]:
# The size is same

In [22]:
df_orders_products_combined.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [24]:
 df = df_orders_products_combined.columns.str.contains('Unnamed')

In [25]:

df

array([ True,  True, False, False, False, False, False, False, False,
       False, False, False])

In [31]:
 df_orders_products_combined.drop(df_orders_products_combined.columns[df_orders_products_combined.columns.str.contains('unnamed',case = False)],axis = 1, inplace = True)

In [32]:
df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [35]:
# Check output for df_prods
df_products.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [ ]:
# Both data contained product_id so will be used to merge the data together. We need to drop the merge column first before continueing

In [37]:
df_ord_products_combined = df_orders_products_combined.drop(columns = ['_merge'])

In [38]:
df_ord_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [ ]:
# Then merge both data together now into one

In [44]:
df_merged = df_ord_products_combined.merge(df_products, on = 'product_id', indicator = True)

In [ ]:
# Check output for df_merged

In [45]:
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [ ]:
# Step 6: Check value counts for '_merge' column

In [46]:
df_merged['_merge'].value_counts()

both          32434212
left_only            0
right_only           0
Name: _merge, dtype: int64

In [ ]:
# Check df_merged size

In [47]:
df_merged.shape

(32434212, 14)

In [ ]:
# Step 7: Export df_merged as orders_products_merged

In [49]:
df_merged.to_pickle(os.path.join(file_path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))